RoanBrand/espix/loader/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
# For an 8MB board build the loader with ../partitions/esp32s3-8mb.csv instead.
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../partitions/esp32s3-16mb.csv"
#
# Deliberately no PSRAM. The loader never needs it, and without it one loader
# serves every module of a target regardless of PSRAM size or mode. It also
# finds the kernel and storage partitions by label at run time, so it does not
# depend on the partition layout either -- one loader per target, not per board.
#
CONFIG_SPIRAM=n
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

#
# Nothing in the loader is interactive: it runs for a few seconds, chooses an
# image and reboots. Asserts and the full printf formatter are weight it does
# not need, and every byte here is a byte the kernel cannot use.
#
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y
CONFIG_NEWLIB_NANO_FORMAT=y

#
# The rootfs image is generated with --name-max=CONFIG_LITTLEFS_OBJ_NAME_LEN in
# the kernel project. littlefs refuses to mount when the image's stored name_max
# is *larger* than the mounter's, so this must be at least the kernel's value;
# a smaller one is the only way to get it wrong. 64 is the default on both sides.
#
CONFIG_LITTLEFS_OBJ_NAME_LEN=64

#
# esp_ota_set_boot_partition() writes otadata's state as set_new_state_otadata(),
# which is ESP_OTA_IMG_NEW only when rollback is enabled in the app doing the
# writing. Without it the loader leaves the installed kernel UNDEFINED, so the
# bootloader never marks it PENDING_VERIFY and a kernel that fails to come up is
# never rolled back. The kernel project already sets this; the loader writes the
# slot, so it needs it too.
#
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

#
# Errors only. The loader should be silent when it works, but a silent fallback
# is exactly how the mount failure above went unnoticed; err-to-name stays on so
# the few lines it does print are legible.
#
CONFIG_LOG_DEFAULT_LEVEL_ERROR=y
CONFIG_ESP_ERR_TO_NAME_LOOKUP=y
